# ViewSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSet Constructor
ViewSet Class See Also
---
Initializes a new instance of the ViewSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ViewSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ViewSet()
```

# See Also
ViewSet Class
Autodesk.Revit.DB Namespace